=============================================================================================================================
Layer (type:depth-idx)                             Input Shape               Output Shape              Param #
=============================================================================================================================
├─Img2Patch: 1-1                                   [-1, 3, 32, 32]           [-1, 16, 3, 8, 8]         --
|    └─Unfold: 2-1                                 [-1, 3, 32, 32]           [-1, 192, 16]             --
├─Projection_layer: 1-2                            [-1, 16, 3, 8, 8]         [-1, 16, 1024]            --
|    └─Linear: 2-2                                 [-1, 16, 192]             [-1, 16, 1024]            197,632
├─ClassEmbedding: 1-3                              [-1, 16, 1024]            [-1, 17, 1024]            1,024
├─TransformerEncoder: 1-4                          [-1, 17, 1024]            [-1, 17, 1024]            --
|    └─ModuleList: 2                               []                        []                        --
|    |    └─TransformerEncoderLayer: 3-1           [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-2           [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-3           [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-4           [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-5           [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-6           [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-7           [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-8           [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-9           [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-10          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-11          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-12          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-13          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-14          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-15          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-16          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-17          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-18          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-19          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-20          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-21          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-22          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-23          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    |    └─TransformerEncoderLayer: 3-24          [-1, 17, 1024]            [-1, 17, 1024]            12,596,224
|    └─LayerNorm: 2-3                              [-1, 17, 1024]            [-1, 17, 1024]            2,048
├─FeedForwardNet: 1-5                              [-1, 17, 1024]            [-1, 10]                  --
|    └─Linear: 2-4                                 [-1, 17, 1024]            [-1, 17, 10]              10,250
|    └─GELU: 2-5                                   [-1, 17, 10]              [-1, 17, 10]              --
|    └─Dropout: 2-6                                [-1, 17, 10]              [-1, 17, 10]              --
=============================================================================================================================
Total params: 302,520,330
Trainable params: 302,520,330
Non-trainable params: 0
Total mult-adds (M): 906.53
=============================================================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 22.70
Params size (MB): 1154.02
Estimated Total Size (MB): 1176.74
=============================================================================================================================
